docs/posts/2011-05-13-calculating-the-end-again-and-again.html
<!DOCTYPE html>
<html lang="en">
<head>
<!-- Dec 29, 2024 -->
<meta charset="utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Calculating the End — Again and Again</title>
<meta name="author" content="Randy Ridenour" />
<meta name="generator" content="Org Mode" />
<link rel='icon' type='image/x-icon' href='/images/favicon.ico'/>
<meta name='viewport' content='width=device-width, initial-scale=1'>
<link rel='stylesheet' href='/css/normalize.css' type='text/css'/>
<link rel='stylesheet' href='/css/main.css' type='text/css'/>
<link rel='stylesheet' href='/css/syntax-coloring.css' type='text/css'/>
</head>
<body>
<header id="top" class="status">
<div class="banner">
  <h2><a href="/">Randy Ridenour</a></h2>
  <nav class="navbar">
    <ul>
      <li><a href="/posts/">Blog</a></li>
      <li><a href="/about.html">About</a></li>
      <li><a href="/tags/">Tags</a></li>
      <li><a href="/index.xml">RSS</a></li>
    </ul>
  </nav>
</div>
</header>
<main id="content" class="content">
<header>
<h1 class="title">Calculating the End — Again and Again</h1>
<p class="subtitle" role="doc-subtitle">May 13, 2011</p>
</header><p>
Apparently, there are many discussing what to expect on May 21. Of course, it&rsquo;s not the first time that the end of the world has been predicted. Bill Leonard, professor of church history at Wake Forest, recently posted an article at <a href="http://www.abpnews.com/content/view/6387/9/">Associated Baptist Press</a>  reviewing past mistaken predictions. Note the final two paragraphs:
</p>

<blockquote>
<p>
For now, let’s keep last things last. The end will come, for individuals and ultimately for the entire enterprise, but perhaps the answers lie, not in escapist theories, but with dying whales, vanishing forests, polluted water and rising ozone, “the fire next time.” We recalculate yet another “Great Disappointment,” but refuse to listen to what the world and its non-human inhabitants are telling us. We hope for “peace and security,” plotting our escape as the planet cries in pain, edging toward its own end.
</p>

<p>
So if there is an ounce of Jesus in any of us, let’s opt out of the Rapture and stay right here to the bitter end, because there is still justice to be done and too much good to be accomplished to forsake this world, even in Jesus’ name. For Jesus’ sake let’s stay behind, loving God with all our hearts, and if we can muster it, loving our neighbors as ourselves.  What Rapture!
</p>
</blockquote>

<p>
Well said.
</p>


<div class="tagline" id="org16e27d4">
<p>
Tagged: <a href="../tags/religion.html">Religion</a>
</p>

</div>
</main>
<footer id="postamble" class="status">
<div class='footer'>
  Copyright © 2024 <a href='mailto:rlridenour@fastmail.com'>Randy Ridenour.</a><br>
  Last updated on Dec 29, 2024.<br>
  Generated using <a href="https://www.gnu.org/software/emacs/">Emacs</a> 29.4 (<a href="https://orgmode.org">Org</a> mode 9.8-pre).
</div>
</footer>
</body>
</html>
